package com.yupi.springbootinit.mapper;

import com.yupi.springbootinit.utils.CreateTableUtil;
import org.junit.jupiter.api.Test;
import org.springframework.boot.test.context.SpringBootTest;

import javax.annotation.Resource;
import java.io.IOException;
import java.util.List;
import java.util.Map;

import static org.junit.jupiter.api.Assertions.*;

@SpringBootTest
class ChartMapperTest {

    @Test
    void createTable() throws IOException {
        String csvData = "年级编号,班级编号,班级名称,学籍号,民族代码,姓名,性别,总分,总分等级\n" +
                "41,2201,材料与能源学院,20221900001,汉族,唐伟琦,男,58.4,不及格\n" +
                "41,2201,材料与能源学院,20221900009,汉族,薛鹏飞,男,56.6,不及格\n" +
                "41,2201,材料与能源学院,20221900024,汉族,李牧修,男,49.9,不及格\n" +
                "41,2201,材料与能源学院,20221900043,汉族,高黉建,男,56,不及格\n" +
                "41,2201,材料与能源学院,20221900047,汉族,程海洋,男,53.6,不及格\n" +
                "41,2201,材料与能源学院,20221900054,汉族,段志达,男,57.3,不及格\n" +
                "41,2201,材料与能源学院,20211900011,汉族,刘渊,男,65.1,及格\n" +
                "41,2201,材料与能源学院,20221900002,汉族,汤楠,女,79.3,及格\n" +
                "41,2201,材料与能源学院,20221900004,汉族,陈涛,男,65.7,及格\n" +
                "41,2201,材料与能源学院,20221900006,汉族,杨贺元,男,61,及格\n" +
                "41,2201,材料与能源学院,20221900010,汉族,张番丽,女,76.4,及格\n" +
                "41,2201,材料与能源学院,20221900011,布依族,贺雨,男,63.1,及格\n" +
                "41,2201,材料与能源学院,20221900012,汉族,刘海洲,男,68,及格\n" +
                "41,2201,材料与能源学院,20221900013,汉族,赵俊芬,女,77.9,及格\n" +
                "41,2201,材料与能源学院,20221900014,汉族,苗雨阳,男,73.4,及格\n" +
                "41,2201,材料与能源学院,20221900016,汉族,魏庆丰,男,61.6,及格\n" +
                "41,2201,材料与能源学院,20221900017,汉族,查达润,男,63.3,及格\n" +
                "41,2201,材料与能源学院,20221900018,汉族,施天宇,男,61.3,及格\n";
        String chartId = "1720732058378063873";
        createTableUtil.createTable(csvData,chartId);
    }

    @Test
    void insertData() {
        String csvData = "年级编号,班级编号,班级名称,学籍号,民族代码,姓名,性别,总分,总分等级\n" +
                "41,2201,材料与能源学院,20221900001,汉族,唐伟琦,男,58.4,不及格\n" +
                "41,2201,材料与能源学院,20221900009,汉族,薛鹏飞,男,56.6,不及格\n" +
                "41,2201,材料与能源学院,20221900024,汉族,李牧修,男,49.9,不及格\n" +
                "41,2201,材料与能源学院,20221900043,汉族,高黉建,男,56,不及格\n" +
                "41,2201,材料与能源学院,20221900047,汉族,程海洋,男,53.6,不及格\n" +
                "41,2201,材料与能源学院,20221900054,汉族,段志达,男,57.3,不及格\n" +
                "41,2201,材料与能源学院,20211900011,汉族,刘渊,男,65.1,及格\n" +
                "41,2201,材料与能源学院,20221900002,汉族,汤楠,女,79.3,及格\n" +
                "41,2201,材料与能源学院,20221900004,汉族,陈涛,男,65.7,及格\n" +
                "41,2201,材料与能源学院,20221900006,汉族,杨贺元,男,61,及格\n" +
                "41,2201,材料与能源学院,20221900010,汉族,张番丽,女,76.4,及格\n" +
                "41,2201,材料与能源学院,20221900011,布依族,贺雨,男,63.1,及格\n" +
                "41,2201,材料与能源学院,20221900012,汉族,刘海洲,男,68,及格\n" +
                "41,2201,材料与能源学院,20221900013,汉族,赵俊芬,女,77.9,及格\n" +
                "41,2201,材料与能源学院,20221900014,汉族,苗雨阳,男,73.4,及格\n" +
                "41,2201,材料与能源学院,20221900016,汉族,魏庆丰,男,61.6,及格\n" +
                "41,2201,材料与能源学院,20221900017,汉族,查达润,男,63.3,及格\n" +
                "41,2201,材料与能源学院,20221900018,汉族,施天宇,男,61.3,及格\n";
        String chartId = "1720732058378063873";
        createTableUtil.insertData(csvData,chartId);
    }

    @Test
    void queryChartData() {
        String chartId = "1659210482555121666";
        String querySql = String.format("select * from chart_%s", chartId);
        List<Map<String, Object>> resultData = chartMapper.queryChartData(querySql);
        System.out.println(resultData);
    }
    @Resource
    private ChartMapper chartMapper;

    @Resource
    private CreateTableUtil createTableUtil;
}